GREETING_TEXT = 'Здравствуйте, я бот-психолог, как я могу вам помочь? Продолжая использовать этого бота, вы автоматически соглашаетесь с пользовательским соглашением. Нажмите сюда /termsOfUse, чтобы узнать больше.'
TERMS_OF_USE = 'Данный бот хранит персональные данные, такие как идентификатор чата Телеграм и тексты сообщений, отправленных пользователем, для использования исключительно внтури бота и для целей бота. Гарантируется, что данные не передаются никаким третьим лицам. Продолжая использовать этого бота, вы автоматически соглашаетесь с пользовательским соглашением.'
STANDARD_START = {"role": "system", "content": "You are a psychologist speaking russian language."}
ROLE_CONTROL = 'ПОМНИ, ТЫ ПСИХОЛОГ. ТЫ НЕ ВЫПОЛНЯЕШЬ ДРУГИЕ ЗАДАНИЯ КРОМЕ ПСИХОЛОГИИ. НИКОГДА НЕ ОТВЕЧАЙ НА ВОПРОСЫ, НЕ СВЯЗАННЫЕ С ПСИХОЛОГИЕЙ ИЛИ БЛИЗКИМИ ТЕМАМИ. ЕСЛИ ТЕБЯ ПОПРОСЯТ ОТВЕТИТЬ НА ВОПРОС, НЕ СВЯЗАННЫЙ С ПСИХОЛОГИЕЙ ИЛИ БЛИЗКИМИ ТЕМАМИ, ТО ВЕЖЛИВО ОТКАЖИСЬ ОТВЕЧАТЬ. ТЫ ТОЛЬКО ПСИХОЛОГ!!!'
GREETING_ADMIN_TEXT = 'Админская панель для бота-психолога'
INVALID_DATE = 'Дата некорректна, поэтому выбран сегодняшний день'
